Repository: Edison-E/BookingNET
Catalog: src/Commons/Resource/Response.*.resx
Languages: es

# AccountExist
source: An account with provided email already exists.
es: Ya existe una cuenta con el correo electrónico proporcionado.

# AddressExist
source: This address is occupied by another company, check the address provided.
es: Esta dirreccion se encuentra ocupada por otra compania, revise la dirrecion proporcionada.

# ErrorCreateAccessToken
source: An error occurred while creating an access token.
es: A ocurrido algo mientras creabamos el access token.

# ErrorInsertAddress
source: The new Address could not be inserted correctly.
es: No se ha podido insertar correctamente la nueva dirección.

# ErrorInsertCompany
source: The new company could not be inserted correctly.
es: No se ha podido insertar correctamente la nueva empresa.

# ErrorParametersRequest
source: The properties of the request are invalid.
es: Las propiedades de la request son invalidas.

# ErrorProccessResetPassword
source: Something happened while resetting the password.
es: Ha ocurrido algo mientras reseteabamos la contraseña

# ErrorProcessAddress
source: Error in the process of inserting a new Address.
es: Error en el proceso de inserción de una nueva Dirección.

# ErrorProcessCompany
source: Error in the process of inserting a new company.
es: Error en el proceso de inserción de una nueva empresa.

# ErrorProcessingAppointment
source: An error occurred while processing the request.
es: Se ha producido un error al procesar la solicitud.

# ErrorSaveAppointment
source: An error occurred while saving the Appointment.
es: Se ha producido un error al guardar la cita.

# ErrorServiceNotExist
source: This service is not available in our system.
es: Este servicio no esta disponble en nuestro sistema.

# ErrorUpdateRoom
source: An error occurred when updating the room.
es: Se ha producido un error al actualizar la sala.

# HappenedTokenError
source: Something happened while we were generating the user's token.
es: Algo sucedió mientras generábamos el token del usuario.

# SuccessInsertAddress
source: The new Address has been inserted correctly
es: La nueva dirección se ha insertado correctamente

# SuccessInsertCompany
source: The new company has been inserted correctly
es: La nueva empresa se ha insertado correctamente

# TokenGenerate
source: The access token has been successfully generated.
es: El access token ha sido generado correctamente.

# TokenInvalid
source: The refresh token is invalid.
es: El refresh token es invalido.

# TokenNotGenerate
source: The token access has not been generated correctly.
es: El access token no se ha generado correctament.

# TokenNotRegister
source: The token refresh not registered successfully.
es: El refresh token no ha sido registrado correctament.

# TokenNotUpdate
source: Not update refresh token and the new refresh token has not been successfully registered.
es: No se ha actualizado el refresh token y no se ha registrado correctamente nuevo refresh token

# TokenResetInvalid
source: The reset token is invalid.
es: El reset token es invalido.

# TokenUpdate
source: The old refresh token has been updated and a new refresh token has been generated and an access token has been generated.
es: El antiguo refresh token ha sido actualizado y generado un nuevo refresh token y generado un acces token.

# TokenValid
source: The refresh token is valid and the access token has been generated.
es: El refresh token es valido y se ha generado el access token

# UserCredentials
source: The credentials user is valid.
es: Las credenciales del usuarios son validas.

# UserErrorUpdatePassword
source: The password could not be updated correctly. Please try again
es: No se ha podido actualizar correctamente la contraseña. Intentalo otra vez

# UserFind
source: User find with this email
es: Usuario encontrado con este email

# UserInvalid
source: The user is invalid.
es: El usuario es invalido.

# UserNotFind
source: An error occurred while find the user.
es: A ocurrido un error mientras buscabamos al usuario.

# UserNotRegister
source: Something happened while the user was being registered.
es: A ocurrido algo mientras se registraba al usuario.

# UserRegister
source: The user has been successfully registered.
es: El usuario ha sido registrado correctamente.

# UserUpdatePassword
source: The password has been updated.
es: La contraseña ha sido actualizada.

# UserVerifingCredentials
source: An ocurred while verifing credentilas with this email
es: A ocurrdio algo miestras verificabamos las credenciales sobre este email
